task1 = "Известна фамилия, нужно найти номер в телефонной книге. "
task2 = "Известен номер, нужно найти фамилию в телефонной книге. (Под­сказка: вам придется провести поиск по всей книге!)"
task3 = "Нужно прочитать телефоны всех людей в телефонной книге. "
task4 = "Нужно прочитать телефоны всех людей, фамилии которых начинают­ся с буквы «А». (Вопрос с подвохом! В нем задействованы концепции, которые более подробно рассматриваются в главе 4. Прочитайте от­вет -скорее всего, он вас удивит!)"
answer = " Ответ: "

print("1.", task1, answer, "O(log n)")
print("2.", task2, answer, "O(n)")
print("3.", task3, answer, "O(n)")
print("4.", task4, answer, "O(n)")